# Задача 1. Напишите программу, которая принимает на
# вход число N и выдает список факториалов для чисел от 1
# до N.

num_n = int(input('Введите число N: '))
factorials = []
num = 1
fact = 1
while num <= num_n:
  fact = fact * num
  factorials.append(fact)
  num += 1
print(f'Список факториалов для чисел от 1 до {num_n} - {factorials}')